In [2]:
import pandas as pd
names = ['Bob','Jessica','Mary','John','Mel']
grades = [76,95,77,78,99]
bsdegrees = [1,1,0,0,1]
msdegrees = [2,1,0,0,0]
phddegrees = [0,1,0,0,0]

In [3]:
GradeList = zip(names,grades,bsdegrees,msdegrees,phddegrees)
df = pd.DataFrame(data=GradeList,
        columns=['Names','Grades','BS_Degrees','MS_Degrees','PHD_Degrees'])
df

     Names  Grades  BS_Degrees  MS_Degrees  PHD_Degrees
0      Bob      76           1           2            0
1  Jessica      95           1           1            1
2     Mary      77           0           0            0
3     John      78           0           0            0
4      Mel      99           1           0            0

In [15]:
print(df.describe())
print()
print('MEDIAN')
print(df.median())
print()
print('MODE')
print(df.mode())
print()
print('VARIANCE')
print(df.var())

          Grades  BS_Degrees  MS_Degrees  PHD_Degrees
count   5.000000    5.000000    5.000000     5.000000
mean   85.000000    0.600000    0.600000     0.200000
std    11.067972    0.547723    0.894427     0.447214
min    76.000000    0.000000    0.000000     0.000000
25%    77.000000    0.000000    0.000000     0.000000
50%    78.000000    1.000000    0.000000     0.000000
75%    95.000000    1.000000    1.000000     0.000000
max    99.000000    1.000000    2.000000     1.000000

MEDIAN
Grades         78.0
BS_Degrees      1.0
MS_Degrees      0.0
PHD_Degrees     0.0
dtype: float64

MODE
     Names  Grades  BS_Degrees  MS_Degrees  PHD_Degrees
0      Bob      76         1.0         0.0          0.0
1  Jessica      77         NaN         NaN          NaN
2     John      78         NaN         NaN          NaN
3     Mary      95         NaN         NaN          NaN
4      Mel      99         NaN         NaN          NaN

VARIANCE
Grades         122.5
BS_Degrees       0.3
MS_Degrees       0.8
PHD_Degrees      0.2
dtype: float64